
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>简介 · 设计模式 python</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="fbigun">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter01/Design.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://pyDesignPattern.github.io" target="_blank" class="custom-link">主页</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter01/Design.html">
            
                <a href="chapter01/Design.html">
            
                    
                    设计原则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter01/">
            
                <a href="chapter01/">
            
                    
                    创建类模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="chapter01/Singleton.html">
            
                <a href="chapter01/Singleton.html">
            
                    
                    单例模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="chapter01/AbstractFactory.html">
            
                <a href="chapter01/AbstractFactory.html">
            
                    
                    工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="chapter01/Builder.html">
            
                <a href="chapter01/Builder.html">
            
                    
                    建造者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="chapter01/Prototype.html">
            
                <a href="chapter01/Prototype.html">
            
                    
                    原型模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="chapter01/Proxy.html">
            
                <a href="chapter01/Proxy.html">
            
                    
                    代理模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="chapter01/Decorator.html">
            
                <a href="chapter01/Decorator.html">
            
                    
                    装饰器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="chapter01/Adapter.html">
            
                <a href="chapter01/Adapter.html">
            
                    
                    适配器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="chapter01/Facade.html">
            
                <a href="chapter01/Facade.html">
            
                    
                    门面模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="chapter01/Composite.html">
            
                <a href="chapter01/Composite.html">
            
                    
                    组合模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="chapter01/Flyweight.html">
            
                <a href="chapter01/Flyweight.html">
            
                    
                    享元模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="chapter01/Bridge.html">
            
                <a href="chapter01/Bridge.html">
            
                    
                    桥梁模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="chapter01/Strategy.html">
            
                <a href="chapter01/Strategy.html">
            
                    
                    策略模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="chapter01/ChainOfResponsibility.html">
            
                <a href="chapter01/ChainOfResponsibility.html">
            
                    
                    责任链模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="chapter01/Command.html">
            
                <a href="chapter01/Command.html">
            
                    
                    命令模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.15" data-path="chapter01/Mediator.html">
            
                <a href="chapter01/Mediator.html">
            
                    
                    中介者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.16" data-path="chapter01/Template.html">
            
                <a href="chapter01/Template.html">
            
                    
                    模板模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.17" data-path="chapter01/Iterator.html">
            
                <a href="chapter01/Iterator.html">
            
                    
                    迭代器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.18" data-path="chapter01/Visitor.html">
            
                <a href="chapter01/Visitor.html">
            
                    
                    访问者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.19" data-path="chapter01/Observer.html">
            
                <a href="chapter01/Observer.html">
            
                    
                    观察者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.20" data-path="chapter01/Interpreter.html">
            
                <a href="chapter01/Interpreter.html">
            
                    
                    解释器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.21" data-path="chapter01/Memento.html">
            
                <a href="chapter01/Memento.html">
            
                    
                    备忘录模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.22" data-path="chapter01/State.html">
            
                <a href="chapter01/State.html">
            
                    
                    状态模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >简介</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<h2 id="&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;">&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;</h2>
<p>&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF1F;&#x5B66;&#x4F1A;&#x5F88;&#x591A;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E86;&#x4E48;&#xFF1F;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B66;&#x4F1A;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x96BE;&#x7684;&#x4E8B;&#xFF0C;&#x800C;&#x201C;&#x5B66;&#x4F1A;&#x201D;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x975E;&#x5E38;&#x96BE;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x524D;&#x4E00;&#x4E2A;&#x201C;&#x4F1A;&#x201D;&#x5F3A;&#x8C03;&#x201C;&#x80FD;&#x201D;&#xFF0C;&#x61C2;&#x8BED;&#x6CD5;&#xFF0C;&#x80FD;&#x5199;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x7B97;&#x662F;&#x524D;&#x8005;&#x7684;&#x201C;&#x4F1A;&#x201D;&#x4E86;&#xFF1B;&#x540E;&#x4E00;&#x4E2A;&#x201C;&#x4F1A;&#x201D;&#xFF0C;&#x5F3A;&#x8C03;&#x201C;&#x7CBE;&#x201D;&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x5149;&#x80FD;&#x5199;&#x51FA;&#x201C;Hello World&#x201D;&#x5E76;&#x4E0D;&#x7B97;&#x662F;&#x540E;&#x8005;&#x7684;&#x201C;&#x4F1A;&#x201D;&#xFF0C;&#x80FD;&#x719F;&#x7EC3;&#x5E94;&#x7528;&#xFF0C;&#x5E76;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x89E3;&#x51B3;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x624D;&#x7B97;&#x662F;&#x771F;&#x6B63;&#x7684;&#x201C;&#x4F1A;&#x201D;&#x3002;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5C31;&#x50CF;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x4EFB;&#x4F55;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E1C;&#x897F;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x5728;&#x4E00;&#x76F4;&#x53D8;&#x5316;&#xFF0C;&#x4E00;&#x76F4;&#x8FDB;&#x5316;&#xFF0C;&#x6B64;&#x523B;&#x5B66;&#x4F1A;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5230;&#x4E86;&#x4E0B;&#x4E00;&#x523B;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x6709;&#x65B0;&#x4E1C;&#x897F;&#x51FA;&#x6765;&#xFF0C;&#x8DDF;&#x4E0A;&#x5B83;&#x8FDB;&#x6B65;&#x7684;&#x8282;&#x594F;&#xFF0C;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x8D39;&#x7CBE;&#x529B;&#x7684;&#x4E8B;&#xFF0C;&#x66F4;&#x522B;&#x8BF4;&#x53BB;&#x5728;&#x8FD9;&#x4E2A;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x53BB;&#x201C;&#x4F1A;&#x201D;&#x7B2C;&#x4E8C;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E86;&#x3002;&#x56E0;&#x800C;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4F7F;&#x7528;&#x8FC7;&#x5F88;&#x591A;&#x79CD;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5145;&#x5206;&#x6761;&#x4EF6;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x4F53;&#x73B0;&#x4E0D;&#x5E94;&#x8BE5;&#x5728;&#x4ED6;&#x4F1A;&#x4F7F;&#x7528;&#x591A;&#x5C11;&#x201C;&#x5DE5;&#x5177;&#x201D;&#xFF0C;&#x800C;&#x662F;&#x4ED6;&#x80FD;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x201C;&#x5DE5;&#x5177;&#x201D;&#xFF0C;&#x521B;&#x9020;&#x591A;&#x4E48;&#x5927;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x89E3;&#x51B3;&#x591A;&#x4E48;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;&#x638C;&#x63E1;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x80FD;&#x7528;&#x81EA;&#x5DF1;&#x7CBE;&#x901A;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x89E3;&#x51B3;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7A0B;&#x5E8F;&#x6240;&#x5FC5;&#x5907;&#x7684;&#x3002;
&#x6B63;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x9762;&#x5BF9;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x63D0;&#x70BC;&#x548C;&#x62BD;&#x8C61;&#x800C;&#x5F62;&#x6210;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x662F;&#x524D;&#x4EBA;&#x4E0D;&#x65AD;&#x8BD5;&#x9A8C;&#xFF0C;&#x8003;&#x8651;&#x4E86;&#x5C01;&#x88C5;&#x6027;&#x3001;&#x590D;&#x7528;&#x6027;&#x3001;&#x6548;&#x7387;&#x3001;&#x53EF;&#x4FEE;&#x6539;&#x3001;&#x53EF;&#x79FB;&#x690D;&#x7B49;&#x5404;&#x79CD;&#x56E0;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#x603B;&#x7ED3;&#x3002;&#x5B83;&#x4E0D;&#x9650;&#x4E8E;&#x4E00;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x60F3;&#x548C;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x610F;&#x4E49;">&#x4E8C;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x610F;&#x4E49;</h2>
<p>&#x73B0;&#x5728;&#x793E;&#x4F1A;&#x7684;&#x53D1;&#x5C55;&#x53EF;&#x8C13;&#x7A81;&#x98DE;&#x731B;&#x8FDB;&#xFF0C;&#x8FC7;&#x53BB;&#x5E38;&#x5E38;&#x88AB;&#x5F53;&#x4F5C;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x6807;&#x6746;&#x7684;&#x201C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x201D;&#x8BBE;&#x8BA1;&#x6A21;&#x578B;&#xFF0C;&#x9010;&#x6E10;&#x8BA9;&#x51FA;&#x4E86;&#x5B83;&#x7684;&#x534A;&#x58C1;&#x6C5F;&#x5C71;&#xFF0C;&#x7ED9;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x4F5C;&#x201C;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x3001;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x201D;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;&#x3002;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x9700;&#x6C42;&#x5C31;&#x663E;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x660E;&#x786E;&#xFF0C;&#x9700;&#x6C42;&#x5E38;&#x5E38;&#x4F34;&#x968F;&#x7740;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x8FDB;&#x884C;&#x800C;&#x53D8;&#x5316;&#x3002;&#x9700;&#x6C42;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x5BF9;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x7684;&#x8981;&#x6C42;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x9AD8;&#x4E86;&#x3002;&#x9996;&#x5148;&#x8981;&#x8003;&#x8651;&#x5404;&#x79CD;&#x53EF;&#x80FD;&#x9700;&#x6C42;&#x7684;&#x517C;&#x5BB9;&#xFF0C;&#x4F46;&#x8003;&#x8651;&#x7684;&#x9700;&#x6C42;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x6DF1;&#x6E0A;&#xFF0C;&#x4E0D;&#x53EF;&#x81EA;&#x62D4;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5BF9;&#x9700;&#x6C42;&#x53D8;&#x66F4;&#x4E0E;&#x4EE3;&#x7801;&#x91CD;&#x7528;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x53C2;&#x8003;&#xFF0C;&#x7531;&#x4E8E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x57FA;&#x672C;&#x4E0A;&#x672C;&#x7740;&#x201C;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x4F4E;&#x8026;&#x5408;&#x201D;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x9075;&#x5FAA;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#xFF0C;&#x5E38;&#x5E38;&#x4F1A;&#x6709;&#x7740;&#x5BF9;&#x9700;&#x6C42;&#x7684;&#x9002;&#x5E94;&#x6027;&#x3002;
&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x7531;&#x4E00;&#x4E2A;&#x4EBA;&#x5B8C;&#x6210;&#xFF0C;&#x6B64;&#x7C7B;&#x9879;&#x76EE;&#x5E38;&#x5E38;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x534F;&#x540C;&#x5F00;&#x53D1;&#x3002;&#x65E2;&#x7136;&#x662F;&#x534F;&#x540C;&#x5F00;&#x53D1;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x6A21;&#x5757;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#xFF0C;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x7F16;&#x5199;&#x7684;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5176;&#x5B83;&#x5DE5;&#x7A0B;&#x5E08;&#x4EE3;&#x7801;&#x7684;&#x8BF8;&#x591A;&#x56E0;&#x5B50;&#x3002;&#x5982;&#x679C;&#x5DE5;&#x7A0B;&#x5E08;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x8FC7;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x65E0;&#x6CD5;&#x5F62;&#x6210;&#x5408;&#x529B;&#xFF0C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x6309;&#x65F6;&#x4FDD;&#x8D28;&#x5B8C;&#x6210;&#x3002;&#x6700;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x8981;&#x5F71;&#x54CD;&#x5230;&#x522B;&#x4EBA;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#xFF0C;&#x53C8;&#x4E0D;&#x5F97;&#x4E0D;&#x53BB;&#x501F;&#x7528;&#x6216;&#x8005;&#x88AB;&#x501F;&#x5230;&#x5176;&#x5B83;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x5176;&#x4E2D;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x667A;&#x6167;&#x7684;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x534F;&#x540C;&#x4F5C;&#x4E1A;&#x7684;&#x53C2;&#x8003;&#xFF0C;&#x9075;&#x5FAA;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x51CF;&#x5C11;&#x6A21;&#x5757;&#x95F4;&#x7684;&#x4E0D;&#x5FC5;&#x8981;&#x4F9D;&#x8D56;&#xFF0C;&#x5728;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x6709;&#x5E8F;&#x8FDB;&#x884C;&#x6709;&#x7740;&#x975E;&#x5E38;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;
&#x516C;&#x53F8;&#x4EBA;&#x4E8B;&#x4F1A;&#x6709;&#x53D8;&#x52A8;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x4F1A;&#x6210;&#x957F;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x54EA;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x79FB;&#x4EA4;&#xFF0C;&#x5373;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x5199;&#x8005;&#x548C;&#x7EF4;&#x62A4;&#x8005;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x3002;&#x90A3;&#x4E48;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x5C31;&#x663E;&#x5F97;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x8BA9;&#x673A;&#x5668;&#x8BFB;&#x61C2;&#x4F60;&#x7684;&#x610F;&#x56FE;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x201C;&#x77DB;&#x76FE;&#x201D;&#xFF0C;&#x800C;&#x8BA9;&#x4EBA;&#x8BFB;&#x61C2;&#x4F60;&#x7684;&#x610F;&#x56FE;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x3002;&#x6309;&#x7167;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x53EF;&#x8BFB;&#x6027;&#x4E5F;&#x4F1A;&#x5927;&#x5927;&#x63D0;&#x5347;&#xFF0C;&#x5229;&#x4E8E;&#x56E2;&#x961F;&#x9879;&#x76EE;&#x7684;&#x7EE7;&#x627F;&#x548C;&#x6269;&#x5C55;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x6709;&#x54EA;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;">&#x4E09;&#x3001;&#x6709;&#x54EA;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;</h2>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x5927;&#x7C7B;&#xFF1A;&#x521B;&#x5EFA;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x7ED3;&#x6784;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x884C;&#x4E3A;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x521B;&#x5EFA;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3001;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3001;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#x3001;&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#xFF1B;&#x7ED3;&#x6784;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x88C5;&#x9970;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x95E8;&#x9762;&#x6A21;&#x5F0F;&#x3001;&#x7EC4;&#x5408;&#x6A21;&#x5F0F;&#x3001;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#x3001;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#xFF1B;&#x884C;&#x4E3A;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x7EC6;&#x5206;&#x4E3A;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x3001;&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#x3001;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#x3001;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x6A21;&#x677F;&#x6A21;&#x5F0F;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#x3001;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x3002;&#x672C;&#x8BFE;&#x7A0B;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x8FD9;23&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x57FA;&#x4E8E;Python&#x4EE3;&#x7801;&#x7684;&#x5B9E;&#x4F8B;&#x5B66;&#x4E60;&#x3002;
&#x968F;&#x7740;&#x73B0;&#x4EE3;&#x793E;&#x4F1A;&#x5404;&#x7C7B;&#x4E1A;&#x52A1;&#x89C4;&#x6A21;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x6311;&#x6218;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E5F;&#x884D;&#x751F;&#x51FA;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x65B0;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x4E0D;&#x5C40;&#x9650;&#x4E8E;&#x8FD9;23&#x79CD;&#xFF0C;&#x5728;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x9488;&#x5BF9;&#x4E9B;&#x65B0;&#x7684;&#x201C;&#x54C1;&#x79CD;&#x201D;&#x4E5F;&#x4F1A;&#x7B80;&#x5355;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x67B6;&#x6784;&#x3001;&#x6846;&#x67B6;&#x7684;&#x5173;&#x7CFB;">&#x56DB;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x67B6;&#x6784;&#x3001;&#x6846;&#x67B6;&#x7684;&#x5173;&#x7CFB;</h2>
<h3 id="1&#x3001;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5173;&#x7CFB;">1&#x3001;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5173;&#x7CFB;</h3>
<p>&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x53D1;&#x5C55;&#x800C;&#x51FA;&#x73B0;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#xFF0C;&#x662F;&#x63D0;&#x53D6;&#x4E86;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x7684;&#x8F6F;&#x4EF6;&#x7684;&#x5171;&#x6027;&#x90E8;&#x5206;&#x6240;&#x5F62;&#x6210;&#x7684;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x534A;&#x6210;&#x54C1;&#x201D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x6846;&#x67B6;&#x4E4B;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x5B9E;&#x73B0;&#x53C8;&#x5FEB;&#x53C8;&#x53EF;&#x9760;&#x7684;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#x3002;
&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x548C;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7814;&#x7A76;&#x9886;&#x57DF;&#xFF1A;A&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5982;&#x524D;&#x8FB9;&#x7684;&#x5B9A;&#x4E49;&#x6240;&#x8BB2;&#xFF0C;&#x5B83;&#x6307;&#x7684;&#x662F;&#x9488;&#x5BF9;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53EF;&#x5E94;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x6846;&#x67B6;&#x548C;&#x88AB;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x6240;&#x5B9E;&#x73B0;&#xFF1B;&#x800C;&#x6846;&#x67B6;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x6216;&#x591A;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x548C;&#x4EE3;&#x7801;&#x7684;&#x6DF7;&#x5408;&#x4F53;&#xFF1B;B&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x76F8;&#x8F83;&#x4E8E;&#x6846;&#x67B6;&#x66F4;&#x5BB9;&#x6613;&#x79FB;&#x690D;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x7528;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#x5219;&#x53D7;&#x9650;&#x4E8E;&#x9886;&#x57DF;&#x5927;&#x73AF;&#x5883;&#x3002;&#x867D;&#x7136;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x548C;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x4ED6;&#x4EEC;&#x4E8C;&#x8005;&#x662F;&#x7EDF;&#x4E00;&#x7684;&#xFF0C;&#x5373;&#x91CD;&#x89C6;&#x8F6F;&#x4EF6;&#x590D;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x3002;</p>
<h3 id="2&#x3001;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5173;&#x7CFB;">2&#x3001;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5173;&#x7CFB;</h3>
<p>&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x662F;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x67B6;&#x6784;&#x8981;&#x8003;&#x8651;&#x8F6F;&#x4EF6;&#x7684;&#x6574;&#x4F53;&#x7ED3;&#x6784;&#x3001;&#x5C42;&#x6B21;&#x5212;&#x5206;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x548C;&#x4EA4;&#x4E92;&#x7B49;&#xFF0C;&#x67B6;&#x6784;&#x7684;&#x7740;&#x773C;&#x70B9;&#x504F;&#x6574;&#x4F53;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x6846;&#x67B6;&#x548C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x8303;&#x56F4;&#x5219;&#x5177;&#x4F53;&#x5F88;&#x591A;&#xFF0C;&#x6846;&#x67B6;&#x7740;&#x773C;&#x4E8E;&#x9886;&#x57DF;&#x5185;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5219;&#x9488;&#x5BF9;&#x4E00;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x548C;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x3002;
&#x603B;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x6846;&#x67B6;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x7279;&#x5B9A;&#x7684;&#x6784;&#x4EF6;&#x7EC4;&#x5408;&#x6765;&#x5B9E;&#x73B0;&#xFF1B;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7ED3;&#x5408;&#x7279;&#x5B9A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x73AF;&#x5883;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x5355;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="chapter01/Design.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 设计原则">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"简介","level":"1.1","depth":1,"next":{"title":"设计原则","level":"1.2","depth":1,"path":"chapter01/Design.md","ref":"chapter01/Design.md","articles":[]},"dir":"ltr"},"config":{"plugins":["prism","-highlight","-lunr","-search","search-plus"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-solarizedlight.css"]},"search-plus":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"fbigun","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a6","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"设计模式 python","language":"zh-hans","output.name":"site","links":{"sidebar":{"主页":"https://pyDesignPattern.github.io"},"sharing":{"google":null,"facebook":null,"twitter":null,"weibo":null,"all":null}},"gitbook":"3.2.3","description":"python中各种设计模式的实现方法","extension":["epub","pdf","mobi"]},"file":{"path":"README.md","mtime":"2019-03-05T09:45:27.522Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-05T16:18:54.355Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

