
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>设计原则 · 设计模式 python</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="fbigun">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="./" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://pyDesignPattern.github.io" target="_blank" class="custom-link">主页</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="Design.html">
            
                <a href="Design.html">
            
                    
                    设计原则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    创建类模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="Singleton.html">
            
                <a href="Singleton.html">
            
                    
                    单例模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="AbstractFactory.html">
            
                <a href="AbstractFactory.html">
            
                    
                    工厂模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="Builder.html">
            
                <a href="Builder.html">
            
                    
                    建造者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="Prototype.html">
            
                <a href="Prototype.html">
            
                    
                    原型模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="Proxy.html">
            
                <a href="Proxy.html">
            
                    
                    代理模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="Decorator.html">
            
                <a href="Decorator.html">
            
                    
                    装饰器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="Adapter.html">
            
                <a href="Adapter.html">
            
                    
                    适配器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="Facade.html">
            
                <a href="Facade.html">
            
                    
                    门面模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="Composite.html">
            
                <a href="Composite.html">
            
                    
                    组合模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="Flyweight.html">
            
                <a href="Flyweight.html">
            
                    
                    享元模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.11" data-path="Bridge.html">
            
                <a href="Bridge.html">
            
                    
                    桥梁模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.12" data-path="Strategy.html">
            
                <a href="Strategy.html">
            
                    
                    策略模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.13" data-path="ChainOfResponsibility.html">
            
                <a href="ChainOfResponsibility.html">
            
                    
                    责任链模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.14" data-path="Command.html">
            
                <a href="Command.html">
            
                    
                    命令模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.15" data-path="Mediator.html">
            
                <a href="Mediator.html">
            
                    
                    中介者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.16" data-path="Template.html">
            
                <a href="Template.html">
            
                    
                    模板模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.17" data-path="Iterator.html">
            
                <a href="Iterator.html">
            
                    
                    迭代器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.18" data-path="Visitor.html">
            
                <a href="Visitor.html">
            
                    
                    访问者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.19" data-path="Observer.html">
            
                <a href="Observer.html">
            
                    
                    观察者模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.20" data-path="Interpreter.html">
            
                <a href="Interpreter.html">
            
                    
                    解释器模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.21" data-path="Memento.html">
            
                <a href="Memento.html">
            
                    
                    备忘录模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.22" data-path="State.html">
            
                <a href="State.html">
            
                    
                    状态模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >设计原则</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8BBE;&#x8BA1;&#x539F;&#x5219;">&#x8BBE;&#x8BA1;&#x539F;&#x5219;</h1>
<h2 id="&#x4E00;&#x3001;&#x516D;&#x5927;&#x8BBE;&#x8BA1;&#x539F;&#x5219;">&#x4E00;&#x3001;&#x516D;&#x5927;&#x8BBE;&#x8BA1;&#x539F;&#x5219;</h2>
<p>&#x5728;&#x6CD5;&#x7406;&#x5B66;&#x4E2D;&#xFF0C;&#x6CD5;&#x5F8B;&#x89C4;&#x5219;&#x4E0E;&#x6CD5;&#x5F8B;&#x539F;&#x5219;&#x90FD;&#x662F;&#x6CD5;&#x5F8B;&#x89C4;&#x8303;&#x7684;&#x91CD;&#x8981;&#x6784;&#x6210;&#x3002;&#x4F46;&#x4E8C;&#x8005;&#x4E5F;&#x4F1A;&#x6709;&#x4E9B;&#x4E0D;&#x540C;&#xFF1A;&#x6CD5;&#x5F8B;&#x89C4;&#x5219;&#x662F;&#x6307;&#x91C7;&#x53D6;&#x4E00;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#x5F62;&#x5F0F;&#x5177;&#x4F53;&#x89C4;&#x5B9A;&#x4EBA;&#x4EEC;&#x7684;&#x6CD5;&#x5F8B;&#x6743;&#x5229;&#x3001;&#x6CD5;&#x5F8B;&#x4E49;&#x52A1;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x6CD5;&#x5F8B;&#x540E;&#x679C;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x8303;&#xFF0C;&#x5185;&#x5BB9;&#x6BD4;&#x8F83;&#x660E;&#x786E;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4EA4;&#x901A;&#x6CD5;&#x89C4;&#x4E2D;&#x89C4;&#x5B9A;&#xFF0C;&#x7981;&#x6B62;&#x95EF;&#x7EA2;&#x706F;&#xFF1B;&#x6CD5;&#x5F8B;&#x539F;&#x5219;&#x662F;&#x6307;&#x5728;&#x4E00;&#x5B9A;&#x6CD5;&#x5F8B;&#x4F53;&#x7CFB;&#x4E2D;&#x4F5C;&#x4E3A;&#x6CD5;&#x5F8B;&#x89C4;&#x5219;&#x7684;&#x6307;&#x5BFC;&#x601D;&#x60F3;&#xFF0C;&#x57FA;&#x672C;&#x6216;&#x672C;&#x539F;&#x7684;&#x3001;&#x7EFC;&#x5408;&#x7684;&#x3001;&#x7A33;&#x5B9A;&#x7684;&#x539F;&#x7406;&#x548C;&#x51C6;&#x5219;&#xFF0C;&#x5185;&#x5BB9;&#x4E0A;&#x53EA;&#x5305;&#x542B;&#x201C;&#x5927;&#x65B9;&#x9488;&#x201D;&#xFF0C;&#x800C;&#x5E76;&#x672A;&#x6709;&#x5177;&#x4F53;&#x89C4;&#x5219;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8F66;&#x4E0A;&#x6709;&#x9A6C;&#x4E0A;&#x4E34;&#x4EA7;&#x7684;&#x5B55;&#x5987;&#xFF0C;&#x95EF;&#x7EA2;&#x706F;&#x4E0D;&#x4F1A;&#x88AB;&#x5904;&#x7F5A;&#xFF0C;&#x8FD9;&#x662F;&#x7B26;&#x5408;&#x91CD;&#x89C6;&#x751F;&#x547D;&#x7684;&#x539F;&#x5219;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x57FA;&#x672C;&#x7B26;&#x5408;&#x89C4;&#x5219;&#x4E0E;&#x539F;&#x5219;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x5219;&#x53CD;&#x6620;&#x4E86;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x6307;&#x5BFC;&#x601D;&#x60F3;&#xFF1B;&#x540C;&#x65F6;&#xFF0C;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x53EF;&#x884D;&#x751F;&#x51FA;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E5F;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x4E0A;&#x8FF0;&#x4ECB;&#x7ECD;&#x5230;&#x4E86;23&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x867D;&#x7136;&#x627E;&#x4E0D;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x4E4B;&#x5339;&#x914D;&#xFF0C;&#x4F46;&#x82E5;&#x7B26;&#x5408;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x79CD;&#x5168;&#x65B0;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x7684;&#x5F62;&#xFF0C;&#x800C;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x662F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x7684;&#x795E;&#x3002;</p>
<h3 id="1&#x3001;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;">1&#x3001;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;</h3>
<p>&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x82F1;&#x6587;&#x539F;&#x540D;&#x4E3A;Single Responsibility Principle&#xFF0C;&#x7B80;&#x79F0;SRP&#x539F;&#x5219;&#x3002;&#x5176;&#x542B;&#x4E49;&#x4E3A;&#xFF1A;&#x5E94;&#x8BE5;&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x5F15;&#x8D77;&#x7C7B;&#x7684;&#x53D8;&#x66F4;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x660E;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#xFF1A;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7C7B;&#x6709;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#x63A5;&#x53E3;&#xFF0C;&#x5373;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x63A5;&#x53E3;&#x548C;&#x97F3;&#x9891;&#x64AD;&#x653E;&#x63A5;&#x53E3;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x4F46;&#x5374;&#x4E0D;&#x6EE1;&#x8DB3;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x7684;&#x3002;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x6709;&#x53D8;&#x66F4;&#x9700;&#x6C42;&#x6216;&#x8005;&#x5BF9;&#x97F3;&#x9891;&#x64AD;&#x653E;&#x6709;&#x4FEE;&#x6539;&#x9700;&#x6C42;&#xFF0C;&#x90FD;&#x4F1A;&#x53D8;&#x66F4;&#x89C6;&#x9891;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7C7B;&#x7ED3;&#x6784;&#x3002;&#x7B26;&#x5408;&#x5355;&#x4E00;&#x539F;&#x5219;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#xFF0C;&#x5C06;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x5355;&#x5143;&#x548C;&#x97F3;&#x9891;&#x64AD;&#x653E;&#x5355;&#x5143;&#x5404;&#x5EFA;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x64AD;&#x653E;&#x5BA2;&#x6237;&#x7AEF;&#x7EE7;&#x627F;&#x4E24;&#x4E2A;&#x7C7B;&#xFF0C;&#x6784;&#x6210;&#x5BA2;&#x6237;&#x7AEF;&#x3002;
&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x7684;&#x6700;&#x5927;&#x96BE;&#x70B9;&#x5728;&#x4E8E;&#x804C;&#x8D23;&#x7684;&#x5212;&#x5206;&#xFF0C;&#x8BD5;&#x60F3;&#xFF0C;&#x4EE5;&#x4E0A;&#x5212;&#x5206;&#x662F;&#x5426;&#x662F;&#x7B26;&#x5408;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x4E86;&#xFF1F;&#x65E2;&#x662F;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x3002;&#x8BD5;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x89C6;&#x9891;&#x4F20;&#x8F93;&#x548C;&#x97F3;&#x9891;&#x4F20;&#x8F93;&#x7684;&#x534F;&#x8BAE;&#x4FE1;&#x606F;&#x548C;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x533A;&#x5206;&#x5F00;&#xFF0C;&#x4E3A;&#x7B26;&#x5408;&#x8FD9;&#x79CD;&#x7C92;&#x5EA6;&#x7684;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x534F;&#x8BAE;&#x4F20;&#x8F93;&#x7C7B;&#x548C;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7C7B;&#x7684;&#x5212;&#x5206;&#x3002;&#x5982;&#x679C;&#x63A5;&#x7740;&#x7EC6;&#x5206;&#xFF0C;&#x53EF;&#x80FD;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5C0F;&#x6A21;&#x5757;&#xFF0C;&#x90FD;&#x8981;&#x8BBE;&#x8BA1;&#x975E;&#x5E38;&#x591A;&#x7684;&#x7C7B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x7C92;&#x5EA6;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x548C;&#x4EBA;&#x5458;&#x5206;&#x5DE5;&#x6765;&#x8FDB;&#x884C;&#x8003;&#x8651;&#x3002;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x5212;&#x5206;&#xFF0C;&#x4F3C;&#x4E4E;&#x5DF2;&#x7ECF;&#x6210;&#x4E86;&#x884C;&#x4E1A;&#x89C4;&#x8303;&#x6027;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E0E;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x7BA1;&#x7406;&#x7684;&#x5212;&#x5206;&#x7B49;&#x3002;</p>
<h3 id="2&#x3001;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;">2&#x3001;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;</h3>
<p>&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x82F1;&#x6587;&#x539F;&#x540D;&#x4E3A;Liskov Substitution Principle&#xFF0C;&#x7B80;&#x79F0;LSP&#x539F;&#x5219;&#x3002;&#x5B83;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x7684;&#x6700;&#x4E3A;&#x57FA;&#x672C;&#x539F;&#x5219;&#x4E4B;&#x4E00;&#x3002; &#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x7684;&#x542B;&#x4E49;&#x4E3A;&#xFF1A;&#x4EFB;&#x4F55;&#x57FA;&#x7C7B;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5B50;&#x7C7B;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x3002; LSP&#x662F;&#x7EE7;&#x627F;&#x590D;&#x7528;&#x7684;&#x57FA;&#x77F3;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x66FF;&#x6362;&#x6389;&#x57FA;&#x7C7B;&#xFF0C;&#x8F6F;&#x4EF6;&#x5355;&#x4F4D;&#x7684;&#x529F;&#x80FD;&#x4E0D;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x65F6;&#xFF0C;&#x57FA;&#x7C7B;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x88AB;&#x590D;&#x7528;&#xFF0C;&#x5B50;&#x7C7B;&#x4E5F;&#x80FD;&#x591F;&#x5728;&#x57FA;&#x7C7B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9E1F;&#x7C7B;&#xFF0C;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x51FA;&#x9EBB;&#x96C0;&#x3001;&#x559C;&#x9E4A;&#x3001;&#x5E03;&#x8C37;&#x7B49;&#x5B50;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B50;&#x7C7B;&#x90FD;&#x53EF;&#x7EE7;&#x627F;&#x9E1F;&#x7C7B;&#x7684;&#x9E23;&#x53EB;&#x3001;&#x98DE;&#x884C;&#x3001;&#x5403;&#x98DF;&#x7B49;&#x63A5;&#x53E3;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9E21;&#x7C7B;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x5728;&#x751F;&#x7269;&#x5B66;&#x4E0A;&#x5C5E;&#x4E8E;&#x9E1F;&#x7C7B;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x4F1A;&#x98DE;&#xFF0C;&#x90A3;&#x4E48;&#x7B26;&#x5408;LSP&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9E21;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x9E1F;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#xFF1A;&#x5728;&#x9E1F;&#x7C7B;&#x8C03;&#x7528;&#x98DE;&#x884C;&#x63A5;&#x53E3;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x9E21;&#x7C7B;&#x5E76;&#x4E0D;&#x80FD;&#x51FA;&#x73B0;&#x3002;&#x5982;&#x679C;&#x9E21;&#x7C7B;&#x8981;&#x4F7F;&#x7528;&#x9E1F;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x5173;&#x8054;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x3002;</p>
<h3 id="3&#x3001;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;">3&#x3001;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;</h3>
<p>&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#x82F1;&#x6587;&#x539F;&#x540D;&#x4E3A;Dependence Inversion Principle&#xFF0C;&#x7B80;&#x79F0;DIP&#x539F;&#x5219;&#x3002;&#x5B83;&#x7684;&#x542B;&#x4E49;&#x4E3A;&#xFF1A;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x4E24;&#x8005;&#x90FD;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x5176;&#x62BD;&#x8C61;&#x3002;&#x62BD;&#x8C61;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x7EC6;&#x8282;&#xFF0C;&#x7EC6;&#x8282;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x4E2A;&#x4E0D;&#x53EF;&#x7EC6;&#x5206;&#x7684;&#x903B;&#x8F91;&#x53EB;&#x4F5C;&#x539F;&#x5B50;&#x903B;&#x8F91;&#xFF0C;&#x539F;&#x5B50;&#x903B;&#x8F91;&#x7EC4;&#x88C5;&#xFF0C;&#x5F62;&#x6210;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#x7EC4;&#x88C5;&#x5F62;&#x6210;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x3002;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#x7684;&#x542B;&#x4E49;&#x4E3A;&#xFF0C;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x548C;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#x90FD;&#x5E94;&#x8BE5;&#x7531;&#x5404;&#x81EA;&#x7684;&#x62BD;&#x8C61;&#x6A21;&#x5757;&#x6D3E;&#x751F;&#x800C;&#x6765;&#xFF0C;&#x540C;&#x65F6;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#xFF0C;&#x800C;&#x975E;&#x5177;&#x4F53;&#x6A21;&#x5757;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x53F8;&#x673A;&#x4E0E;&#x6C7D;&#x8F66;&#x662F;&#x4F9D;&#x8D56;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x53F8;&#x673A;&#x53EF;&#x4EE5;&#x6709;&#x5B9E;&#x4E60;&#x53F8;&#x673A;&#x7C7B;&#x3001;&#x8001;&#x53F8;&#x673A;&#x7C7B;&#x7B49;&#x6D3E;&#x751F;&#xFF1B;&#x6C7D;&#x8F66;&#x53EF;&#x4EE5;&#x6709;&#x8F7F;&#x8F66;&#x3001;SUV&#x3001;&#x5361;&#x8F66;&#x7B49;&#x6D3E;&#x751F;&#x7C7B;&#x3002;&#x5982;&#x679C;&#x53F8;&#x673A;&#x4E2D;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;drive&#xFF0C;&#x6C7D;&#x8F66;&#x662F;&#x5176;&#x53C2;&#x6570;&#xFF0C;&#x7B26;&#x5408;DIP&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x5728;&#x57FA;&#x7C7B;&#x53F8;&#x673A;&#x7C7B;&#x4E2D;&#xFF0C;&#x5C06;&#x57FA;&#x7C7B;&#x6C7D;&#x8F66;&#x7C7B;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x53F8;&#x673A;&#x7684;&#x6D3E;&#x751F;&#x7C7B;&#x4E2D;&#xFF0C;drive&#x7684;&#x53C2;&#x6570;&#x540C;&#x6837;&#x5E94;&#x8BE5;&#x4E3A;&#x57FA;&#x7C7B;&#x6C7D;&#x8F66;&#x7C7B;&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x6C7D;&#x8F66;&#x7C7B;&#x7684;&#x4EFB;&#x4E00;&#x4E2A;&#x6D3E;&#x751F;&#x7C7B;&#x3002;&#x5982;&#x679C;&#x89C4;&#x5B9A;&#x5B9E;&#x4E60;&#x53F8;&#x673A;&#x53EA;&#x80FD;&#x5F00;&#x8F7F;&#x8F66;&#x7B49;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x5E94;&#x8BE5;&#x5728;&#x5176;&#x63A5;&#x53E3;&#x4E2D;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x8BE5;&#x5C06;&#x53C2;&#x6570;&#x66FF;&#x6362;&#x6210;&#x5B50;&#x7C7B;&#x8F7F;&#x8F66;&#x3002;</p>
<h3 id="4&#x3001;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;">4&#x3001;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;</h3>
<p>&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x82F1;&#x6587;&#x539F;&#x540D;&#x4E3A;Interface Segregation Principle&#xFF0C;&#x7B80;&#x79F0;ISP&#x539F;&#x5219;&#x3002;&#x5176;&#x542B;&#x4E49;&#x4E3A;&#xFF1A;&#x7C7B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4E0D;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x5176;&#x6700;&#x5C0F;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5373;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x90A3;&#x4E9B;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x63A5;&#x53E3;&#x7684;&#x6982;&#x5FF5;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4ECE;&#x903B;&#x8F91;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x6307;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x7684;&#x96C6;&#x5408;&#xFF1B;&#x4ECE;&#x4E1A;&#x52A1;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x63A5;&#x53E3;&#x5C31;&#x53EF;&#x4EE5;&#x6307;&#x7279;&#x5B9A;&#x4E1A;&#x52A1;&#x4E0B;&#x7684;&#x63A5;&#x53E3;&#xFF08;&#x5982;&#x51FD;&#x6570;&#xFF0C;URL&#x8C03;&#x7528;&#x7B49;&#xFF09;&#x3002;&#x63A5;&#x53E3;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x5C0F;&#xFF0C;&#x540C;&#x65F6;&#x4EC5;&#x7559;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x8981;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5F03;&#x7528;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#xFF1A;&#x5982;&#x679C;&#x8981;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x751F;&#x6210;&#x997C;&#x56FE;&#x3001;&#x76F4;&#x65B9;&#x56FE;&#x3001;&#x8868;&#x683C;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x8BE5;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#xFF1F;&#x5982;&#x679C;&#x5C06;&#x751F;&#x6210;&#x997C;&#x56FE;&#x3001;&#x76F4;&#x65B9;&#x56FE;&#x3001;&#x8868;&#x683C;&#x7B49;&#x201C;&#x63A5;&#x53E3;&#x201D;&#xFF08;&#x8FD9;&#x91CC;&#x7684;&#x63A5;&#x53E3;&#x5C31;&#x662F;&#x201C;&#x64CD;&#x4F5C;&#x201D;&#x7684;&#x96C6;&#x5408;&#x7684;&#x6982;&#x5FF5;&#xFF09;&#xFF0C;&#x5199;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#xFF0C;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x7684;&#x3002;&#x7B26;&#x5408;ISP&#x539F;&#x5219;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x662F;&#x8BBE;&#x8BA1;&#x4E09;&#x4E2A;&#x7C7B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x5206;&#x522B;&#x5B9E;&#x73B0;&#x997C;&#x56FE;&#x3001;&#x76F4;&#x65B9;&#x56FE;&#x3001;&#x8868;&#x683C;&#x7684;&#x7ED8;&#x5236;&#x3002;
&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x548C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x4E00;&#x6837;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x7C92;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x7C92;&#x5EA6;&#x5927;&#x5C0F;&#xFF0C;&#x540C;&#x6837;&#x4F9D;&#x8D56;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#xFF0C;&#x9700;&#x8981;&#x8BFB;&#x8005;&#x6839;&#x636E;&#x5B9E;&#x8DF5;&#x53BB;&#x6743;&#x8861;&#x3002;</p>
<h3 id="5&#x3001;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#xFF08;&#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219;&#xFF09;">5&#x3001;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#xFF08;&#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219;&#xFF09;</h3>
<p>&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#xFF08;Law of Demeter&#xFF09;&#x4E5F;&#x53EB;&#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219;&#xFF0C;&#x82F1;&#x6587;Least Knowledge Principle&#xFF0C;&#x7B80;&#x79F0;LKP&#x539F;&#x5219;&#x3002;&#x5176;&#x542B;&#x4E49;&#x4E3A;&#xFF1A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5E94;&#x8BE5;&#x5BF9;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x6709;&#x6700;&#x5C11;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#xFF1A;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x6709;&#x591A;&#x4E2A;&#x90E8;&#x95E8;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x95E8;&#x6709;&#x591A;&#x4E2A;&#x5458;&#x5DE5;&#xFF0C;&#x5982;&#x679C;&#x516C;&#x53F8;CEO&#x8981;&#x4E0B;&#x53D1;&#x901A;&#x77E5;&#x7ED9;&#x6BCF;&#x4E2A;&#x5458;&#x5DE5;&#xFF0C;&#x662F;&#x8C03;&#x7528;&#x63A5;&#x53E3;&#x76F4;&#x63A5;&#x901A;&#x77E5;&#x6240;&#x6709;&#x5458;&#x5DE5;&#x4E48;&#xFF1F;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#xFF0C;CEO&#x53EA;&#x9700;&#x548C;&#x5B83;&#x7684;&#x201C;&#x670B;&#x53CB;&#x201D;&#x7C7B;&#x90E8;&#x95E8;Leader&#x4EA4;&#x6D41;&#x5C31;&#x597D;&#xFF0C;&#x90E8;&#x95E8;Leader&#x518D;&#x4E0B;&#x53D1;&#x901A;&#x77E5;&#x4FE1;&#x606F;&#x5373;&#x53EF;&#x3002;&#x800C;CEO&#x7C7B;&#x4E0D;&#x9700;&#x8981;&#x4E0E;&#x5458;&#x5DE5;&#x8FDB;&#x884C;&#x201C;&#x4EA4;&#x6D41;&#x201D;&#x3002;
&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x8981;&#x6C42;&#x5BF9;&#x8C61;&#x5E94;&#x8BE5;&#x4EC5;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x670B;&#x53CB;&#x7C7B;&#x4EA4;&#x6D41;&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x8BE5;&#x5BF9;&#x975E;&#x670B;&#x53CB;&#x7C7B;&#x4EA4;&#x6D41;&#x3002;&#x90A3;&#x4EC0;&#x4E48;&#x624D;&#x662F;&#x670B;&#x53CB;&#x7C7B;&#x5462;&#xFF1F;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x670B;&#x53CB;&#x7C7B;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x5F81;&#xFF1A;
1&#xFF09;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF08;self&#xFF09;&#xFF1B;
2&#xFF09;&#x4EE5;&#x53C2;&#x91CF;&#x5F62;&#x5F0F;&#x4F20;&#x5165;&#x5230;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;
3&#xFF09;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;
4&#xFF09;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x5982;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x805A;&#x96C6;&#xFF0C;&#x90A3;&#x4E48;&#x805A;&#x96C6;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x4E5F;&#x90FD;&#x662F;&#x670B;&#x53CB;&#xFF1B;
5&#xFF09;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<h3 id="6&#x3001;&#x5F00;&#x95ED;&#x539F;&#x5219;">6&#x3001;&#x5F00;&#x95ED;&#x539F;&#x5219;</h3>
<p>&#x5F00;&#x95ED;&#x539F;&#x5219;&#x82F1;&#x6587;&#x539F;&#x540D;&#x4E3A;Open Closed Principle&#xFF0C;&#x7B80;&#x79F0;OCP&#x539F;&#x5219;&#x3002;&#x5176;&#x542B;&#x4E49;&#x4E3A;&#xFF1A;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#xFF0C;&#x5982;&#x7C7B;&#x3001;&#x6A21;&#x5757;&#x3001;&#x51FD;&#x6570;&#x7B49;&#xFF0C;&#x5E94;&#x8BE5;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#x3002;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x662F;&#x975E;&#x5E38;&#x57FA;&#x7840;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x628A;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x79F0;&#x4E3A;&#x201C;&#x539F;&#x5219;&#x7684;&#x539F;&#x5219;&#x201D;&#x3002;&#x524D;&#x9762;&#x8BB2;&#x5230;&#x8FC7;&#xFF0C;&#x6A21;&#x5757;&#x5206;&#x539F;&#x5B50;&#x6A21;&#x5757;&#xFF0C;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x4E1A;&#x52A1;&#x5C42;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x6700;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x6A21;&#x5757;&#x3002;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6A21;&#x5757;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x7684;&#xFF0C;&#x5F53;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x9700;&#x6C42;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x4F7F;&#x5176;&#x5177;&#x6709;&#x6EE1;&#x8DB3;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x7684;&#x65B0;&#x529F;&#x80FD;&#xFF1B;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#xFF0C;&#x5373;&#x5BF9;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x65F6;&#xFF0C;&#x4E0D;&#x5FC5;&#x6539;&#x52A8;&#x6A21;&#x5757;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x6700;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x4E1A;&#x52A1;&#x53D8;&#x52A8;&#x65F6;&#xFF0C;&#x4EC5;&#x4FEE;&#x6539;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x4FEE;&#x6539;&#x4F9D;&#x8D56;&#x7684;&#x6A21;&#x5757;&#xFF08;&#x7C7B;&#x3001;&#x51FD;&#x6570;&#x7B49;&#xFF09;&#x4EE3;&#x7801;&#xFF0C;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x4F9D;&#x8D56;&#x7684;&#x6A21;&#x5757;&#x5355;&#x5143;&#x6765;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x53D8;&#x5316;&#x3002;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#xFF1A;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x539F;&#x59CB;&#x57FA;&#x7C7B;&#x6C34;&#x679C;&#x7C7B;&#xFF0C;&#x82F9;&#x679C;&#x7C7B;&#x662F;&#x5B83;&#x7684;&#x6D3E;&#x751F;&#x7C7B;&#xFF0C;&#x82F9;&#x679C;&#x4E2D;&#x5305;&#x542B;&#x6C34;&#x679C;&#x7684;&#x5404;&#x79CD;&#x5C5E;&#x6027;&#xFF0C;&#x5982;&#x5F62;&#x72B6;&#x3001;&#x989C;&#x8272;&#x7B49;&#xFF1B;&#x53E6;&#x6709;&#x4E24;&#x4E2A;&#x7C7B;&#xFF0C;&#x519C;&#x6C11;&#x7C7B;&#x548C;&#x82B1;&#x56ED;&#x7C7B;&#xFF0C;&#x6700;&#x9AD8;&#x5C42;&#x6B21;&#xFF08;&#x4E1A;&#x52A1;&#x5C42;&#x6B21;&#xFF09;&#x4E3A;&#x519C;&#x6C11;&#x5728;&#x82B1;&#x56ED;&#x79CD;&#x82F9;&#x679C;&#x3002;&#x5982;&#x679C;&#x6B64;&#x65F6;&#xFF0C;&#x519C;&#x6C11;&#x51B3;&#x5B9A;&#x4E0D;&#x79CD;&#x82F9;&#x679C;&#x4E86;&#xFF0C;&#x6539;&#x79CD;&#x68A8;&#xFF0C;&#x7B26;&#x5408;OCP&#x539F;&#x5219;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x4E3A;&#x57FA;&#x4E8E;&#x6C34;&#x679C;&#x7C7B;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7C7B;&#xFF0C;&#x5373;&#x68A8;&#x7C7B;&#xFF08;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF09;&#xFF0C;&#x800C;&#x5E76;&#x4E0D;&#x5E94;&#x8BE5;&#x53BB;&#x4FEE;&#x6539;&#x82F9;&#x679C;&#x7C7B;&#xFF0C;&#x4F7F;&#x5B83;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x68A8;&#x7C7B;&#xFF08;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#xFF09;&#x3002;&#x4FEE;&#x6539;&#x5E94;&#x4EC5;&#x5728;&#x6700;&#x9AD8;&#x5C42;&#xFF0C;&#x5373;&#x4E1A;&#x52A1;&#x5C42;&#x4E2D;&#x8FDB;&#x884C;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x9075;&#x5FAA;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x597D;&#x5904;">&#x4E8C;&#x3001;&#x9075;&#x5FAA;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x597D;&#x5904;</h2>
<p>&#x7531;&#x4E8E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x63D0;&#x70BC;&#xFF0C;&#x56E0;&#x800C;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x597D;&#x5904;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x5373;&#xFF1A;&#x4EE3;&#x7801;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#xFF1B;&#x66F4;&#x9002;&#x4E8E;&#x56E2;&#x4F53;&#x5408;&#x4F5C;&#xFF1B;&#x9002;&#x5E94;&#x9700;&#x6C42;&#x53D8;&#x5316;&#x7B49;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;">&#x4E09;&#x3001;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x4E0E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</h2>
<h3 id="1&#x3001;&#x521B;&#x5EFA;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;">1&#x3001;&#x521B;&#x5EFA;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;</h3>
<p>&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF1A;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;&#x89E3;&#x8026;&#x7ED3;&#x6784;&#xFF0C;&#x5DE5;&#x5382;&#x7C7B;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x62BD;&#x8C61;&#x4EA7;&#x54C1;&#x7C7B;&#xFF0C;&#x7B26;&#x5408;&#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219;&#xFF08;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#xFF09;&#xFF1B;&#x540C;&#x65F6;&#x7B26;&#x5408;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#x548C;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#xFF1B;
&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF1A;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4EA7;&#x54C1;&#x65CF;&#x8981;&#x6269;&#x5C55;&#xFF0C;&#x5DE5;&#x5382;&#x7C7B;&#x4E5F;&#x8981;&#x4FEE;&#x6539;&#xFF0C;&#x8FDD;&#x53CD;&#x4E86;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF1B;
&#x6A21;&#x677F;&#x6A21;&#x5F0F;&#xFF1A;&#x4F18;&#x79C0;&#x7684;&#x6269;&#x5C55;&#x80FD;&#x529B;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x3002;</p>
<h3 id="2&#x3001;&#x7ED3;&#x6784;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;">2&#x3001;&#x7ED3;&#x6784;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;</h3>
<p>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#xFF1A;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E2D;&#x5C06;&#x5BF9;&#x4E3B;&#x4F53;&#x5BF9;&#x8C61;&#x7684;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#xFF0C;&#x5408;&#x9002;&#x7684;&#x5E94;&#x7528;&#x4F1A;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x548C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#xFF1B;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x51E0;&#x4E4E;&#x5E26;&#x6709;&#x89E3;&#x8026;&#x4F5C;&#x7528;&#x7684;&#x7ED3;&#x6784;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x90FD;&#x591A;&#x5C11;&#x7B26;&#x5408;&#x4E9B;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF1B;
&#x95E8;&#x9762;&#x6A21;&#x5F0F;&#xFF1A;&#x95E8;&#x9762;&#x6A21;&#x5F0F;&#x4E0D;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF0C;&#x6709;&#x65F6;&#x4E0D;&#x7B26;&#x5408;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#xFF0C;&#x5982;&#x82E5;&#x4E0D;&#x6CE8;&#x610F;&#xFF0C;&#x4E5F;&#x4F1A;&#x89E6;&#x78B0;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#xFF1B;
&#x7EC4;&#x5408;&#x6A21;&#x5F0F;&#xFF1A;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x4E00;&#x822C;&#x5728;&#x62FC;&#x63A5;&#x6811;&#x65F6;&#x4F7F;&#x7528;&#x5B9E;&#x73B0;&#x7C7B;&#xFF0C;&#x6545;&#x4E0D;&#x7B26;&#x5408;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#xFF1B;
&#x6865;&#x6881;&#x6A21;&#x5F0F;&#xFF1A;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x582A;&#x79F0;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#x7684;&#x5178;&#x8303;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x3002;</p>
<h3 id="3&#x3001;&#x884C;&#x4E3A;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;">3&#x3001;&#x884C;&#x4E3A;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x8BBE;&#x8BA1;&#x539F;&#x5219;</h3>
<p>&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#xFF1A;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF0C;&#x4F46;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x3002;&#x884C;&#x4E3A;&#x7C7B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x591A;&#x5C11;&#x4F1A;&#x7B26;&#x5408;&#x4E9B;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x5982;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#x3001;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x7B49;&#xFF1B;
&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#xFF1A;&#x7B26;&#x5408;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x548C;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#xFF1B;
&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#xFF1A;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x3002;</p>
<p>&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E2D;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E5F;&#x4F1A;&#x663E;&#x793A;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7279;&#x70B9;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x4F53;&#x73B0;&#xFF0C;&#x4F46;&#x4F53;&#x73B0;&#x4E0D;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x662F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x800C;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x7684;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="./" class="navigation navigation-next " aria-label="Next page: 创建类模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"设计原则","level":"1.2","depth":1,"next":{"title":"创建类模式","level":"1.3","depth":1,"path":"chapter01/README.md","ref":"chapter01/README.md","articles":[{"title":"单例模式","level":"1.3.1","depth":2,"path":"chapter01/Singleton.md","ref":"chapter01/Singleton.md","articles":[]},{"title":"工厂模式","level":"1.3.2","depth":2,"path":"chapter01/AbstractFactory.md","ref":"chapter01/AbstractFactory.md","articles":[]},{"title":"建造者模式","level":"1.3.3","depth":2,"path":"chapter01/Builder.md","ref":"chapter01/Builder.md","articles":[]},{"title":"原型模式","level":"1.3.4","depth":2,"path":"chapter01/Prototype.md","ref":"chapter01/Prototype.md","articles":[]},{"title":"代理模式","level":"1.3.5","depth":2,"path":"chapter01/Proxy.md","ref":"chapter01/Proxy.md","articles":[]},{"title":"装饰器模式","level":"1.3.6","depth":2,"path":"chapter01/Decorator.md","ref":"chapter01/Decorator.md","articles":[]},{"title":"适配器模式","level":"1.3.7","depth":2,"path":"chapter01/Adapter.md","ref":"chapter01/Adapter.md","articles":[]},{"title":"门面模式","level":"1.3.8","depth":2,"path":"chapter01/Facade.md","ref":"chapter01/Facade.md","articles":[]},{"title":"组合模式","level":"1.3.9","depth":2,"path":"chapter01/Composite.md","ref":"chapter01/Composite.md","articles":[]},{"title":"享元模式","level":"1.3.10","depth":2,"path":"chapter01/Flyweight.md","ref":"chapter01/Flyweight.md","articles":[]},{"title":"桥梁模式","level":"1.3.11","depth":2,"path":"chapter01/Bridge.md","ref":"chapter01/Bridge.md","articles":[]},{"title":"策略模式","level":"1.3.12","depth":2,"path":"chapter01/Strategy.md","ref":"chapter01/Strategy.md","articles":[]},{"title":"责任链模式","level":"1.3.13","depth":2,"path":"chapter01/ChainOfResponsibility.md","ref":"chapter01/ChainOfResponsibility.md","articles":[]},{"title":"命令模式","level":"1.3.14","depth":2,"path":"chapter01/Command.md","ref":"chapter01/Command.md","articles":[]},{"title":"中介者模式","level":"1.3.15","depth":2,"path":"chapter01/Mediator.md","ref":"chapter01/Mediator.md","articles":[]},{"title":"模板模式","level":"1.3.16","depth":2,"path":"chapter01/Template.md","ref":"chapter01/Template.md","articles":[]},{"title":"迭代器模式","level":"1.3.17","depth":2,"path":"chapter01/Iterator.md","ref":"chapter01/Iterator.md","articles":[]},{"title":"访问者模式","level":"1.3.18","depth":2,"path":"chapter01/Visitor.md","ref":"chapter01/Visitor.md","articles":[]},{"title":"观察者模式","level":"1.3.19","depth":2,"path":"chapter01/Observer.md","ref":"chapter01/Observer.md","articles":[]},{"title":"解释器模式","level":"1.3.20","depth":2,"path":"chapter01/Interpreter.md","ref":"chapter01/Interpreter.md","articles":[]},{"title":"备忘录模式","level":"1.3.21","depth":2,"path":"chapter01/Memento.md","ref":"chapter01/Memento.md","articles":[]},{"title":"状态模式","level":"1.3.22","depth":2,"path":"chapter01/State.md","ref":"chapter01/State.md","articles":[]}]},"previous":{"title":"简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["prism","-highlight","-lunr","-search","search-plus"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-solarizedlight.css"]},"search-plus":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"fbigun","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a6","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"设计模式 python","language":"zh-hans","output.name":"site","links":{"sidebar":{"主页":"https://pyDesignPattern.github.io"},"sharing":{"google":null,"facebook":null,"twitter":null,"weibo":null,"all":null}},"gitbook":"3.2.3","description":"python中各种设计模式的实现方法","extension":["epub","pdf","mobi"]},"file":{"path":"chapter01/Design.md","mtime":"2019-03-05T15:02:11.213Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-05T16:18:54.355Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

